07_First_Rails_App/solutions/rails_animals/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    @animals = Animal.all

INSERT INTO "animals" ("created_at", "name", "region", "size", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-03-18 04:11:43.218211"], ["name", "Zebrelphant"], ["region", "Golden Gate Park"], ["size", "GIGANTIC"], ["updated_at", "2015-03-18 04:11:43.218211"]]
---
  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save

UPDATE "animals" SET "color" = ?, "updated_at" = ? WHERE "animals"."id" = 1  [["color", "Orange"], ["updated_at", "2015-03-18 04:14:06.522323"]]
---
  def update
    respond_to do |format|
      if @animal.update(animal_params)

SELECT  "animals".* FROM "animals"  WHERE "animals"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_animal
    @animal = Animal.find(params[:id])